#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.
```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu plan -no-color
hcloud_firewall.vps_proxy: Refreshing state... [id=2441380]
hcloud_server.server: Refreshing state... [id=109599699]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # hcloud_firewall.vps_proxy will be updated in-place
  ~ resource "hcloud_firewall" "vps_proxy" {
        id     = "2441380"
      ~ labels = {
          ~ "Last-Provisioned" = "2025-09-24T16.52.16-0500" -> "2025-09-24T17.06.36-0500"
            # (3 unchanged elements hidden)
        }
        name   = "vps-proxy"

        # (8 unchanged blocks hidden)
    }

  # hcloud_server.server must be replaced
-/+ resource "hcloud_server" "server" {
      + backup_window              = (known after apply)
      ~ id                         = "109599699" -> (known after apply)
      ~ ipv4_address               = "178.156.186.50" -> (known after apply)
      ~ ipv6_address               = "2a01:4ff:f0:84c::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4ff:f0:84c::/64" -> (known after apply)
      ~ labels                     = {
          ~ "Last-Provisioned" = "2025-09-24T16.52.16-0500" -> "2025-09-24T17.06.36-0500"
            # (3 unchanged elements hidden)
        }
      ~ location                   = "ash" -> (known after apply)
        name                       = "vps-proxy"
      - placement_group_id         = 0 -> null
      ~ primary_disk_size          = 40 -> (known after apply)
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = "K7FojBypanYszl0hMplGSLYzMOQ=" -> "Trm0DoxidyBA6yccjWJjmKQ96Rw=" # forces replacement
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ server_id   = "109599699" -> (known after apply)
  ~ server_ipv4 = "178.156.186.50" -> (known after apply)
  ~ server_ipv6 = "2a01:4ff:f0:84c::1" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

*Pusher: @willquill, Action: `pull_request`, Working Directory: `opentofu`, Workflow: `PR`*

*Last updated: 9/24/2025, 5:06:38 PM CST*